app/views/paths/show.html.haml

  %tbody
    - @path.lessons.each do |lesson|
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."path_id" = ?  [["path_id", 2]]