app/controllers/lessons_controller.rb

  def new
    @path = Path.find(params[:path_id])
---
SELECT  "paths".* FROM "paths" WHERE "paths"."id" = ? LIMIT 1  [["id", 3]]

  def create
    @path = Path.find(params[:path_id])
    @lesson = @path.lessons.build(lesson_params)
    @lesson.user = current_user

    respond_to do |format|
      if @lesson.save
---
SELECT  "paths".* FROM "paths" WHERE "paths"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "lessons" ("name", "url", "path_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Angular Basics"], ["url", "www.google.com?angularbasics"], ["path_id", 3], ["created_at", "2015-05-29 20:25:17.563926"], ["updated_at", "2015-05-29 20:25:17.563926"]]

  def update
    respond_to do |format|
      if @lesson.update(lesson_params)
---
UPDATE "lessons" SET "name" = ?, "updated_at" = ? WHERE "lessons"."id" = ?  [["name", "Drunk Angular Basics"], ["updated_at", "2015-05-29 20:29:05.911141"], ["id", 4]]

    def set_path
      @path = Path.find(params[:path_id])
---
SELECT  "paths".* FROM "paths" WHERE "paths"."id" = ? LIMIT 1  [["id", 3]]