app/controllers/paths_controller.rb

  def index
    @paths = Path.all
---
SELECT "paths".* FROM "paths"

  def create
    @path = current_user.paths.build(path_params)

    respond_to do |format|
      if @path.save
---
INSERT INTO "paths" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Foo!"], ["created_at", "2015-05-28 19:16:35.879896"], ["updated_at", "2015-05-28 19:16:35.879896"]]

  def update
    respond_to do |format|
      if @path.update(path_params)
---
UPDATE "paths" SET "name" = ?, "updated_at" = ? WHERE "paths"."id" = ?  [["name", "Bar"], ["updated_at", "2015-05-29 20:24:24.715474"], ["id", 2]]

    def set_path
      @path = Path.find(params[:id])
---
SELECT  "paths".* FROM "paths" WHERE "paths"."id" = ? LIMIT 1  [["id", 2]]